# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

© Explore Data Science Academy

### Honour Code

I {**YOUR NAME**, **YOUR SURNAME**}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

<div align="center" style="width: 600px; font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Bhejane_large.jpg"
     alt="The Black Rhino"
     style="float: center; padding-bottom=0.5em"
     width=600px/>
     Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>


The Bhejane trading store is an online retailer specialising in Covid essesstial items. The store has recently be struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the databasse, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [1]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

In [2]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [3]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [4]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150) NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 11:50:43 AM SAST; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

In [5]:
# DO NOT EDIT CELL
# Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables


<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [6]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT * FROM Products
LIMIT 2;

Query started at 11:50:43 AM SAST; Query executed in 0.00 m

,Width,Length,Height,Barcode,Quantity,Brand,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,,,,300507946,493,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,1 x Hikvision 1080P Bullet camera,399.0
1,,,,300507946,493,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,Manual,399.0

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1NF.png" alt="1st Normal Form ERD" border="0">

It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [7]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS "Products_1NF";
DROP TABLE IF EXISTS "Transactions_1NF";

CREATE TABLE "Products_1NF"(
    "Barcode" VARCHAR(150) NOT NULL,
    "NavigationPath" VARCHAR(150) NOT NULL,
    "ItemDescription" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "Colour" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    FOREIGN KEY ("Barcode") REFERENCES "Transactions_1NF" ("Barcode"),
    PRIMARY KEY("Barcode","NavigationPath","ItemDescription")
);

CREATE TABLE "Transactions_1NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_1NF" ("Barcode"),
    PRIMARY KEY("CartID", "Barcode")
);

Query started at 11:50:43 AM SAST; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [8]:
%%read_sql
--#Populate the 1NF tables
DELETE FROM "Products_1NF";
DELETE FROM "Transactions_1NF";

INSERT INTO "Products_1NF" ("Barcode","NavigationPath","ItemDescription","Colour","ProductDescription","Brand",
                            "Price","Quantity","PackType","Warranty","StockCountry","Weight_kg",
                            "Volume_litre","Length","Width","Height")
SELECT DISTINCT
     Barcode
    ,NavigationPath
    ,ItemDescription
    ,Colour
    ,ProductDescription
    ,Brand
    ,Price
    ,Quantity
    ,PackType
    ,Warranty
    ,StockCountry
    ,Weight_kg
    ,Volume_litre
    ,Length
    ,Width
    ,Height 
FROM 
    Products;

INSERT INTO "Transactions_1NF"("CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions;

Query started at 11:50:43 AM SAST; Query executed in 0.00 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2NF.png" alt="2nd Normal Form ERD" border="0">

In [9]:
%%read_sql
--#Create tables required for 2NF

DROP TABLE IF EXISTS "Products_2NF";
DROP TABLE IF EXISTS "Transactions_2NF";
DROP TABLE IF EXISTS "Navigation_2NF";
DROP TABLE IF EXISTS "PackageContents_2NF";
DROP TABLE IF EXISTS "Colours_2NF";



CREATE TABLE "Products_2NF"(
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    PRIMARY KEY("RegistryID" AUTOINCREMENT),
    FOREIGN KEY("PathID") REFERENCES "Navigation_2NF" ("PathID"),
    FOREIGN KEY("ItemID") REFERENCES "PackageContents_2NF" ("ItemID"),
    FOREIGN KEY("ColourID") REFERENCES "Colours_2NF" ("ColourID") 
    FOREIGN KEY ("Barcode") REFERENCES "Transactions_2NF" ("Barcode")
);



CREATE TABLE "Transactions_2NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_2NF" ("Barcode"),
    PRIMARY KEY("CartID", "Barcode")
);


CREATE TABLE "Navigation_2NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "Colours_2NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_2NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

Query started at 11:50:44 AM SAST; Query executed in 0.00 m

In [10]:
%%read_sql
-- #Populate the tables so that they conform to 2NF

DELETE FROM "Products_2NF";
DELETE FROM "Transactions_2NF";
DELETE FROM "Navigation_2NF";
DELETE FROM "PackageContents_2NF";
DELETE FROM "Colours_2NF";


INSERT INTO "Navigation_2NF"("NavigationPath")
SELECT DISTINCT 
    NavigationPath 
FROM
    Products;
    
INSERT INTO "PackageContents_2NF"("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products
WHERE ItemDescription <> '';
    
INSERT INTO "Colours_2NF"("Colour")
SELECT DISTINCT 
    Colour
FROM
    Products
WHERE Colour <> '';

INSERT INTO "Products_2NF" ("PathID","ItemID","ColourID","Barcode","ProductDescription","Brand","Price",
                            "Quantity","StockCountry","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    Navigation_2NF.PathID,
    PackageContents_2NF.ItemID,
    Colours_2NF.ColourID,
    Barcode,
    ProductDescription,
    Brand,
    Price,
    Quantity,
    StockCountry,
    Weight_kg, 
    Volume_litre, 
    Length,
    Width,
    Height 
FROM 
    Products
LEFT JOIN Navigation_2NF ON Products.NavigationPath = Navigation_2NF.NavigationPath 
LEFT JOIN PackageContents_2NF ON Products.ItemDescription = PackageContents_2NF.ItemDescription
LEFT JOIN Colours_2NF ON Products.Colour = Colours_2NF.Colour;


INSERT INTO "Transactions_2NF"("CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Transactions.Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions
JOIN Products_2NF ON Transactions.Barcode = Products_2NF.Barcode ;

Query started at 11:50:44 AM SAST; Query executed in 0.00 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3NF.png" alt="3rd Normal Form ERD" border="0"></a>

In [11]:
%%read_sql

--#Create tables required for 2NF
DROP TABLE IF EXISTS "Transactions_3NF";
DROP TABLE IF EXISTS "Products_3NF";
DROP TABLE IF EXISTS "Users_3NF";
DROP TABLE IF EXISTS "Navigation_3NF";
DROP TABLE IF EXISTS "PackageContents_3NF";
DROP TABLE IF EXISTS "Colours_3NF";
DROP TABLE IF EXISTS "Brands_3NF";
DROP TABLE IF EXISTS "Locations_3NF";

CREATE TABLE "Products_3NF" (
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    "BrandID" INTEGER,
    "LocationID" INTEGER,
    PRIMARY KEY("RegistryID" AUTOINCREMENT),
    FOREIGN KEY("PathID") REFERENCES "Navigation_3NF" ("PathID"),
    FOREIGN KEY("ItemID") REFERENCES "PackageContents_3NF" ("ItemID"),
    FOREIGN KEY("ColourID") REFERENCES "Colours_3NF" ("ColourID") ,
    FOREIGN KEY ("BrandID") REFERENCES "Brands_3NF" ("BrandID"),
    FOREIGN KEY ("Barcode") REFERENCES "Transactions_3NF" ("Barcode"),
    FOREIGN KEY ("LocationID") REFERENCES "Locations_3NF" ("LocationID")
);

CREATE TABLE "Transactions_3NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserID" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_3NF" ("Barcode"),
    FOREIGN KEY ("UserID") REFERENCES "Users_3NF"("UserID")
    PRIMARY KEY("CartID", "Barcode")
);


CREATE TABLE "Users_3NF"(
    "UserID" INTEGER NOT NULL,
    UserName VARCHAR(50) NOT NULL,
    PRIMARY KEY("UserID" AUTOINCREMENT)
);


CREATE TABLE "Navigation_3NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_3NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

CREATE TABLE "Colours_3NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);


CREATE TABLE "Brands_3NF"(
    "BrandID" INTEGER NOT NULL,
    "Brand" VARCHAR(150),
    PRIMARY KEY("BrandID" AUTOINCREMENT)
);

CREATE TABLE "Locations_3NF"(
    "LocationID" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    PRIMARY KEY("LocationID" AUTOINCREMENT)
);

Query started at 11:50:45 AM SAST; Query executed in 0.00 m

In [12]:
%%read_sql

--# Populate the tables to that they conform to the 3rd Normal Form
DELETE FROM "Products_3NF";
DELETE FROM "Transactions_3NF";
DELETE FROM "Users_3NF";
DELETE FROM "Navigation_3NF";
DELETE FROM "PackageContents_3NF";
DELETE FROM "Colours_3NF";
DELETE FROM "Brands_3NF";
DELETE FROM "Locations_3NF";

INSERT INTO "Users_3NF" ("UserName")
SELECT DISTINCT UserName FROM Transactions_2NF;

INSERT INTO "Locations_3NF" ("StockCountry")
SELECT DISTINCT StockCountry FROM Products_2NF
WHERE StockCountry <> '';

INSERT INTO "Brands_3NF" ("Brand")
SELECT DISTINCT Brand FROM Products_2NF
WHERE Brand <> '';

INSERT INTO "Colours_3NF" ("Colour")
SELECT DISTINCT Colour FROM Colours_2NF;

INSERT INTO "PackageContents_3NF" ("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    PackageContents_2NF
WHERE ItemDescription <> '';

INSERT INTO "Navigation_3NF" ("NavigationPath")
SELECT DISTINCT 
    NavigationPath 
FROM
    Navigation_2NF;
    
INSERT INTO "Transactions_3NF"("CartID","Barcode","UserID","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Transactions_2NF.Barcode
    ,Users_3NF.UserID
    ,InvoiceDate
    ,Total
FROM
    Transactions_2NF
JOIN Products_2NF ON Transactions_2NF.Barcode = Products_2NF.Barcode 
JOIN Users_3NF ON Transactions_2NF.UserName = Users_3NF.Username;


INSERT INTO "Products_3NF" ("PathID","ItemID","ColourID","BrandID","LocationID",
                            "Barcode","ProductDescription","Price",
                            "Quantity","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    Navigation_3NF.PathID,
    PackageContents_3NF.ItemID,
    Colours_3NF.ColourID,
    Brands_3NF.BrandID,
    Locations_3NF.LocationID,
    Barcode,
    ProductDescription,
    Price,
    Quantity,
    Weight_kg, 
    Volume_litre, 
    Length,
    Width,
    Height 
FROM 
    Products
LEFT JOIN Navigation_3NF ON Products.NavigationPath = Navigation_3NF.NavigationPath 
LEFT JOIN PackageContents_3NF ON Products.ItemDescription = PackageContents_3NF.ItemDescription
LEFT JOIN Colours_3NF ON Products.Colour = Colours_3NF.Colour
LEFT JOIN Brands_3NF ON Products.Brand = Brands_3NF.Brand
LEFT JOIN Locations_3NF ON Products.StockCountry = Locations_3NF.StockCountry
;

Query started at 11:50:45 AM SAST; Query executed in 0.00 m

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many products (Total Stock) does the company have?

In [13]:
%%read_sql
-- Write your query here:

SELECT sum(Quantity) FROM 
(
    SELECT DISTINCT Barcode, Quantity
    FROM Products_3NF 
);

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

   sum(Quantity)
0         155515

Q2) Which user(s) bought from Bhejane on the 25th of March in 2020?

In [14]:
%%read_sql
-- Write your query here:
SELECT DISTINCT U.UserName 
FROM Transactions_3NF T
JOIN Users_3NF U ON T.UserID = U.UserID
WHERE InvoiceDate LIKE "2020-03-25%"

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

  UserName
0   Sandra

Q3) List the date(s) where Mandla bought something from Bhejane.

In [15]:
%%read_sql
-- Write your query here:
SELECT DISTINCT InvoiceDate
FROM Transactions_3NF T
JOIN Users_3NF U ON T.UserID = U.UserID
WHERE UserName = 'Mandla'

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

          InvoiceDate
0  2020-06-07 0:00:00
1  2020-04-09 0:00:00
2  2020-04-11 0:00:00

Q4) Which brand has the largest product variety available at Bhejane?

In [16]:
%%read_sql
-- Write your query here:
SELECT COUNT (DISTINCT( p.Barcode )) AS Product_variety, b.Brand
FROM Products_3NF AS p
JOIN Brands_3NF AS b
ON p.BrandID = b.BrandID
GROUP BY b.Brand
ORDER BY Product_variety DESC

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

     Product_variety                  Brand
0                 16                SanDisk
1                 11          Russell Hobbs
2                 11                Pampers
3                  9                  Canon
4                  7                  Gizmo
..               ...                    ...
227                1                Amplify
228                1              All Hands
229                1  African Beauty Secret
230                1                  ADATA
231                1           &Accessories

[232 rows x 2 columns]

Q5) How much did Zanele spend on the 4th of March 2020?

In [17]:
%%read_sql
-- Write your query here:
SELECT UserName, Total, InvoiceDate
FROM Transactions_3NF TRN
JOIN Users_3NF US ON TRN.UserID = US.UserID
WHERE UserName = 'Zanele' AND InvoiceDate LIKE "2020-04-04%"
GROUP BY InvoiceDate

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

  UserName   Total         InvoiceDate
0   Zanele  3464.0  2020-04-04 0:00:00

Q6) Assuming the average pick-up truck can hold 90 $m^{3}$ of stock. How many bags of 'Catmor - Dry Cat Food - Chicken - 4kg' can you fit in the truck? Round down your answer to the nearest whole number.

1$m^{3}$ = 1000000$cm^{3}$

In [18]:
%%read_sql
-- Write your query here:
SELECT 
    DISTINCT ProductDescription ,
    (90000000 / (Length*Height*Width)) as Quantity
FROM Products_3NF
Where ProductDescription = 'Catmor - Dry Cat Food - Chicken - 4kg'

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

                      ProductDescription  Quantity
0  Catmor - Dry Cat Food - Chicken - 4kg  6.105006

Q7) Which user spent the most having only bought 4 items in the Year 2020?

In [19]:
%%read_sql
-- Write your query here:
Select 
    Count(Barcode) as Total_Goods_Bought , 
    Total, 
    t.UserID, 
    u.Username
From Transactions_3NF as t
Join Users_3NF as u On u.UserID = t.UserID
Group By t.UserID
Having Total_Goods_Bought = 4
Order By Total desc
Limit 5

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

   Total_Goods_Bought   Total UserID  UserName
0                   4  3301.0      5    Junaid
1                   4  1716.0     15  Margaret
2                   4  1523.0      1    DIMPHO
3                   4  1134.0     23     Daffy
4                   4  1114.0     17       Mel

Q8) What would the total price be if I had the following items in my cart?

* Estee Lauder Double Wear Stay In Place Makeup
* Angelcare - Nappy Bin Refill - 3 Pack
* RCT 650VA Line Interactive UPS

In [20]:
%%read_sql
-- Write your query here:
SELECT SUM(Price) FROM 
(
SELECT DISTINCT ProductDescription,Price
FROM Products_3NF 
WHERE ProductDescription IN ('Estee Lauder Double Wear Stay In Place Makeup',
                             'Angelcare - Nappy Bin Refill - 3 Pack',
                             'RCT 650VA Line Interactive UPS') 
)

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

   SUM(Price)
0      1599.0

Q9) From a stock count point of view, which product in Bhejane has the highest quantity?

In [21]:
%%read_sql
-- Write your query here:
Select Distinct ProductDescription, Quantity
From Products_3NF
Order by Quantity desc
Limit 10

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

                                  ProductDescription  Quantity
0                         Beard Growth Essential Oil       500
1                   WD Elements Portable 1TB USB 3,0       499
2  Home Quip USB Rechargeable Emergency Lantern -...       499
3  Face Mask - Reusable Sponge with 1 Breathing V...       499
4  Mecer MyLife | Intel Dual Core Celeron | 4GB |...       499
5                             Rawbiotics Gut 1 Litre       498
6            Medmart Health Fingertip Pulse Oximeter       497
7                         Bennett Read Vacuum Sealer       495
8  Duracell Rechargeable AAA 900mAh Batteries - 4...       494
9  Dettol Hygiene Wipes - Hand Wipes - Surface Cl...       494

Q10) How many products are imported from the United Kingdom?

In [22]:
%%read_sql

SELECT COUNT(DISTINCT Barcode) 
FROM Products_3NF P
JOIN Locations_3NF L ON P.LocationID=L.LocationID 
WHERE StockCountry = 'United Kingdom'

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

   COUNT(DISTINCT Barcode)
0                        4

Q11) What is the name and colour of the following item (Barcode TAL00035388021)?

In [23]:
%%read_sql
-- Write your query here
Select distinct c.Colour , p.ProductDescription , p.Barcode
From Colours_3NF as c
Join Products_3NF as p
On c.ColourID = p.ColourID
--Where p.Barcode like 'TAL00035388021'

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

,Colour,ProductDescription,Barcode
0,Grey,ZEE 3-in-1 Unisex Gaiter,10325354918
1,Fresco,Estee Lauder Double Wear Stay In Place Makeup,27131187035
2,Red,Wahl Easy Cut 15 Piece Complete Hair Clipper Kit,43917963358
3,White,Generic AirPods for Apple (with Charging Case),190198987563
4,Black,HP Notebook 255 G7,193808791192
...,...,...,...
247,Black,Pulse Oxymeter - Fingertip Oxygen Screening Mo...,PULSEOXYARCH
248,Black,Sponduct Face Mask - 360 Filter Reusable Washa...,SPONDUCT360SINGLE
249,Black,Essence Long Lasting Eye Pencil - 01 Black,TAL00035386983
250,Blue,Angelcare - Nappy Bin Refill - 3 Pack,TAL00035388021
251,White,Pampers Complete Clean Baby Wipes - 6 x 64 - 3...,TAL00035388407

Q12) How many beer brands exist in the database?

In [24]:
%%read_sql
-- Write your query here:
SELECT COUNT(DISTINCT BrandID) 
FROM Products_3NF WHERE 
ProductDescription like '%Beer%'

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

   COUNT(DISTINCT BrandID)
0                        5

Q13) Which product contains the most package contents and belongs to more than 2 navigation paths?

In [25]:
%%read_sql

-- Write your query here
SELECT DISTINCT Barcode, ProductDescription, COUNT(ItemID) AS NumberofContents, PathID
FROM Products_3NF
GROUP BY Barcode, PathID
ORDER BY NumberofContents DESC
LIMIT 10

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

,Barcode,ProductDescription,NumberofContents,PathID
0,6003000542475,Art Set - 66 Piece,11,176
1,6003000542475,Art Set - 66 Piece,11,178
2,6003000542475,Art Set - 66 Piece,11,179
3,6003000542475,Art Set - 66 Piece,11,180
4,MPTAL00115390,Chukbok 15 Piece Heavy Bottom Stainless Steel ...,11,332
5,MPTAL00115390,Chukbok 15 Piece Heavy Bottom Stainless Steel ...,11,333
6,6002674006115,Mellerware - Biltong King Food Dehydrator,10,175
7,6003000640348,Nutribullet - Blender Original 600W - 8 Piece,8,181
8,6003000640348,Nutribullet - Blender Original 600W - 8 Piece,8,182
9,6009706869533,"Bennett Read Aerovac Vacuum Cleaner 2,0",8,255

Q14) Which user bought the product: "Canon PG-445 & CL-446 Ink Cartridges Multipack" in the month of May 2020 and what is their warranty type?

In [26]:
%%read_sql
-- Write your query here:
SELECT U.UserName, P.ProductDescription, PC.Warranty
FROM Products_3NF P
JOIN PackageContents_3NF PC ON P.ItemID = PC.ItemID
JOIN Transactions_3NF T ON T.Barcode = P.Barcode
JOIN Users_3NF U ON U.UserId = T.UserID
WHERE ProductDescription="Canon PG-445 & CL-446 Ink Cartridges Multipack"
AND InvoiceDate LIKE "2020-05%"

Query started at 11:50:46 AM SAST; Query executed in 0.00 m

,UserName,ProductDescription,Warranty
0,Melokuhle,Canon PG-445 & CL-446 Ink Cartridges Multipack,Non-Returnable (12 months)

Q15) Which user(s) bought silver coloured products from the Russell Hobbs brand?

In [27]:
%%read_sql
SELECT DISTINCT
    CLR.Colour,
    USR_TRN.UserName,
    BRD.Brand
FROM Products_3NF PRD
JOIN Colours_3NF CLR ON CLR.ColourID = PRD.ColourID
JOIN Brands_3NF BRD ON BRD.BrandID = PRD.BrandID
JOIN (SELECT 
        USR.UserName,
        USR.UserId,
        TRN.Barcode
      FROM Transactions_3NF TRN
      JOIN Users_3NF USR ON TRN.UserId = USR.UserId
    ) USR_TRN ON USR_TRN.Barcode = PRD.Barcode

WHERE CLR.Colour='Silver' 
   AND BRD.Brand = 'Russell Hobbs'

Query started at 11:50:47 AM SAST; Query executed in 0.00 m

   Colour  UserName          Brand
0  Silver     Karyn  Russell Hobbs
1  Silver  Clodeane  Russell Hobbs